
## Plan Result (prd)

[CI link](https://github.com/fumi-mura/tfaction-sample/actions/runs/16575405108)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * aws_cloudwatch_log_group.foo2
* Delete
  * aws_cloudwatch_log_group.foo1


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_cloudwatch_log_group.foo1 will be destroyed
  # (because aws_cloudwatch_log_group.foo1 is not in configuration)
  - resource "aws_cloudwatch_log_group" "foo1" {
      - arn               = "arn:aws:logs:ap-northeast-1:644370126241:log-group:foo" -> null
      - id                = "foo" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "foo" -> null
      - region            = "ap-northeast-1" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {} -> null
      - tags_all          = {
          - "Env"                = "prd"
          - "ManagedByTerraform" = "true"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.foo2 will be created
  + resource "aws_cloudwatch_log_group" "foo2" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "foo"
      + name_prefix       = (known after apply)
      + region            = "ap-northeast-1"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Env"                = "prd"
          + "ManagedByTerraform" = "true"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":12,"Program":"tfcmt","SHA1":"b119d91a6ff71214b003b0d0439afd501af04f23","Target":"prd","Vars":{},"WorkflowName":"Terraform plan"} -->